In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [6]:
%%sql
create database if not exists tutorial;
use tutorial;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
0 rows affected.

[]

In [17]:
%%sql

DROP TABLE IF EXISTS tutorial.employees;
DROP TABLE IF EXISTS tutorial.contractors;

CREATE TABLE tutorial.employees (
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    position VARCHAR(50),
    salary DECIMAL(10, 2)
);

CREATE TABLE tutorial.contractors (
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    position VARCHAR(50),
    hourly_rate DECIMAL(10, 2)
);

INSERT INTO tutorial.employees (first_name, last_name, position, salary) VALUES
('Alice', 'Smith', 'Developer', 70000.00),
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

INSERT INTO tutorial.contractors (first_name, last_name, position, hourly_rate) VALUES
('Dave', 'Williams', 'Developer', 40.00),
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
3 rows affected.

[]

In [18]:
%%sql
SELECT * FROM tutorial.employees

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Alice', 'Smith', 'Developer', Decimal('70000.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 ('Charlie', 'Lee', 'Manager', Decimal('90000.00'))]

In [19]:
%%sql
SELECT * FROM tutorial.contractors

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Dave', 'Williams', 'Developer', Decimal('40.00')),
 ('Eve', 'Brown', 'Tester', Decimal('35.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('45.00'))]

In [12]:
# Union all
# JUST STACKS THE TABLES

# Union all just combines select statements
# selected columns in the tables must have the same structure and datatypes

In [22]:
%%sql
SELECT * FROM tutorial.employees
UNION ALL
SELECT * FROM tutorial.contractors

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Alice', 'Smith', 'Developer', Decimal('70000.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 ('Charlie', 'Lee', 'Manager', Decimal('90000.00')),
 ('Dave', 'Williams', 'Developer', Decimal('40.00')),
 ('Eve', 'Brown', 'Tester', Decimal('35.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('45.00'))]

In [15]:
# Union

# union removes duplicates if the selected row values of the both tables match
# it won't remove if there is even a single deviation

In [24]:
%%sql
SELECT first_name,last_name,position FROM tutorial.employees
UNION
SELECT first_name,last_name,position FROM tutorial.contractors

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Alice', 'Smith', 'Developer'),
 ('Bob', 'Johnson', 'Developer'),
 ('Charlie', 'Lee', 'Manager'),
 ('Dave', 'Williams', 'Developer'),
 ('Eve', 'Brown', 'Tester')]

In [23]:
%%sql
SELECT * FROM tutorial.employees
UNION
SELECT * FROM tutorial.contractors

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Alice', 'Smith', 'Developer', Decimal('70000.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 ('Charlie', 'Lee', 'Manager', Decimal('90000.00')),
 ('Dave', 'Williams', 'Developer', Decimal('40.00')),
 ('Eve', 'Brown', 'Tester', Decimal('35.00')),
 ('Bob', 'Johnson', 'Developer', Decimal('45.00'))]